Repository: za/debian-handbook_id-ID
Catalog: */70_conclusion.po
Languages: id_id

source: Future
id_id: Masa Depan

source: Improvements
id_id: Perkembangan

source: Opinions
id_id: Pandangan

source: Conclusion: Debian's Future
id_id: Kesimpulan : Masa Depan Debian

source: The story of Falcot Corp ends with this last chapter; but Debian lives on, and the future will certainly bring many interesting surprises.
id_id: Kisah tentang Falcot Corp berakhir tetapi Debian tetap hidup, terus berkembang dan akan memberikan beberapa kejutan.

source: Upcoming Developments
id_id: Pengembangan Selanjutnya

source: Weeks (or months) before a new version of Debian is released, the Release Manager picks the codename for the next version. Now that Debian version 7 is out, the developers are already busy working on the next version, codenamed <emphasis role="distribution">Jessie</emphasis>…
id_id: Beberapa minggu (atau beberapa bulan) sebelum Debian versi terbaru dirilis, Manajer Rilis menentukan nama kode untuk rilis berikutnya. Sekarang Debian 6 telah selesai dirilis, pengembang sedang mengembangkan versi berikutnya dengan nama kode <emphasis role="distribution">Wheezy</emphasis>

source: There's no official list of planned changes, and Debian never makes promises relating to technical goals of the coming versions. However, a few development trends can already be noted, and we can try some bets on what might happen (or not).
id_id: Memang tidak ada daftar resmi tentang rencana perubahan, dan Debian tidak pernah memberikan janji yang berhubungan dengan tekhnis tujuan dari versi yang akan datang. Namun, beberapa tren pengembangan sudah terlihat, dan ada banyak alasan yang meyakinkan bahwa perubahan itu terwujud di versi selanjutnya.

source: The default “init” process (<command>sysvinit</command>) will hopefully be replaced by a more modern system such as <command>upstart</command> or <command>systemd</command>. Some ports will be gone: <literal>s390</literal> has been superseded by <literal>s390x</literal>, <literal>sparc</literal> and <literal>ia64</literal> might follow as they suffer from multiple problems (lack of recent hardware, lack of Debian porters, lack of upstream support, etc.). <command>dpkg</command> will gain a <command>--verify</command> command that renders <command>debsums</command> mostly obsolete.
id_id: Sistem Manajemen Paket akan dapat memasang paket untuk arsitektur yang berbeda dalam sistem yang sama atau yang juga disebut dengan "multi-arch support". Hal ini memungkinkan untuk memasang aplikasi 32 bit ke dalam sistem 64 bit, dan begitu juga sebaliknya. Proyek lain yang layak adalah <emphasis>Constantly Usable Testing</emphasis>, yang mendapatkan label <emphasis role="distribution">Testing</emphasis> sebagai distribusi yang didukung secara resmi untuk digunakan masyarakat luas. Prose init secara default menggunakan (<command>sysvinit</command>) kemungkinan akan digantikan oleh <command>upstart</command> atau <command>systemd</command> yang lebih modern.

source: Of course, all the main software suites will have had a major release. Apache 2.4 (or newer) will have a strong impact on deployed websites as many configuration files will have to be updated. The Linux kernel is likely to have a much improved container support (with user namespaces, paving the path towards more secure containers). And the latest version of the various desktops will bring better usability and new features. GNOME 3 will be much more polished and the fans of the good old GNOME 2 will be pleased with the inclusion of <ulink url="http://mate-desktop.org/">MATE</ulink> in Debian.
id_id: Tentunya, banyak paket utama yang akan mengalami perubahan besar. Sebagai contoh, <emphasis role="distribution">Wheezy</emphasis> menggunakan GNOME 3.x dengan tampilan grafis yang memukau.

source: Debian's Future
id_id: Masa Depan Debian

source: In addition to these internal developments, one can reasonably expect new Debian-based distributions to come to light, as many tools keep making this task easier. New specialized subprojects will also be started, in order to widen Debian's reach to new horizons.
id_id: Selain pengembangan internal, satu hal yang bisa diharapkan dari distribusi baru turunan Debian berkembang dengan baik adalah berkat populernya <emphasis>debian-installer</emphasis> dan fleksibilitasnya. Subproyek khusus juga akan dimulai, untuk memperluas jangkauan Debian menuju cakrawala baru.

source: The Debian user community will increase, and new contributors will join the project… including, maybe, you!
id_id: Komunitas Pengguna Debian akan bertambah, dan pengembang-pengembang baru akan bergabung ke dalam proyek... termasuk, mungkin Anda!

source: Future of this Book
id_id: Kelanjutan buku ini

source: See you soon!
id_id: Sampai jumpa!
